
/***************************************************************************//**
 * \file filename.с
 * \brief Краткое описание, назначение
 * \remarks Необязательная секция, для комментариев
 * \author Автор
 *
 * \if use_svn_keywords
 *  ::                                    $: Revision of last commit
 *  ::                                        $: Date of last commit
 *  ::                                      $: Author of last commit
 * \endif
 *
 * \b LICENSE \b INFORMATION \n
 *  Copyright (c) Year, Company, City, Country
 ******************************************************************************/

/*******************************************************************************
 * Includes
 ******************************************************************************/
// Подключение необходимого минимума заголовочных файлов
// Первым должен подключаться интерфейсный файл модуля
#include <stdio.h>
#include "parserGPS.H"

//#include "parserGPS.h"
/*******************************************************************************
 * Macro Definitions
 ******************************************************************************/
// Локальные макроопределения

/*******************************************************************************
 * Extern Data
 ******************************************************************************/
// Объявления экземпляров экспортируемых данных
data_almanax_GPS almanax_GPS[75];
/*******************************************************************************
 * Local Data
 ******************************************************************************/
// Локальные объявления типов и данных

/*******************************************************************************
 * Local Function Prototypes
 ******************************************************************************/
// Прототипы локальных функций (без комментариев)

/*******************************************************************************
 * Function Pointers
 ******************************************************************************/
// Объявление указателей на функции (без комментариев)

/*******************************************************************************
 * Function Definitions
 ******************************************************************************/
// Реализация функций
// Сначала реализация интерфейсных функций, далее реализация локальных функций
// Все функции должны иметь описание

/*******************************************************************************
 * END OF FILE
 *****************************************************/


int parseGPS(const char* file)
{
  int i;
  int  Numbb;
  char systype;
  char dummy[50];
    FILE *fd;
   // string file = "MCCJ_150306.AGP";
    fd = fopen(file, "r");
   //fd = fopen("test.txt", "r");
    if (fd == NULL)
    {
         printf("ERORR");
    }
    else{ printf("OK"); }
    while ( !feof(fd) )                               // пока не конец файла
    {
    //   almanax_GPS[i-1].systype = systype;

//Строка 1
fscanf(fd, "%u", (int *)dummy); //1 - число получения альманаха
fscanf(fd, "%u", (int *)dummy); //2 - месяц получения альманаха
fscanf(fd, "%u", (int *)dummy); //3 - год получения альманаха
fscanf(fd, "%u", &Numbb); //4 -


//Строка 2
fscanf(fd, "%u", &(i));//1 - номер PRN
almanax_GPS[i-1].PRN=i;
almanax_GPS[i-1].NN = Numbb;
fscanf(fd, "%u", (int *)dummy);//2 - обобщенный признак здоровья
fscanf(fd, "%u", &( almanax_GPS[i-1].num_week));//3 - неделя GPS (альманаха)
fscanf(fd, "%u", &( almanax_GPS[i-1].time_week));//4 - время недели GPS, с (альманаха)
fscanf(fd, "%u", (int *)dummy);//5 - число
fscanf(fd, "%u", (int *)dummy);//6 - месяц
fscanf(fd, "%u", (int *)dummy);//7 - год
fscanf(fd, "%lf", &( almanax_GPS[i-1].t_almanax));//8 - время альманаха, с
fscanf(fd, "%lf", (int *)dummy);//9 - поправка времени КА GPS относительно системного времени, с
fscanf(fd, "%lf", (int *)dummy);//10- скорость поправки времени КА GPS относительно системного времени, с/с
fscanf(fd, "%lf", &( almanax_GPS[i-1].vOm0));//11- Om0 - скорость долготы узла, полуциклы/c

//Строка 3
fscanf(fd, "%lf", &( almanax_GPS[i-1].Om0));//1 - Om0 - долгота узла, полуциклы
fscanf(fd, "%lf", &( almanax_GPS[i-1].I));//2 - I - наклонение, полуциклы
fscanf(fd, "%lf", &( almanax_GPS[i-1].w));//3 - w - аргумент перигея, полуциклы
fscanf(fd, "%lf", &( almanax_GPS[i-1].E));//4 - E - эксцентриситет
fscanf(fd, "%lf", &( almanax_GPS[i-1].sqrtA));//5 - SQRT(A) - корень из большой полуоси, м**0.5
fscanf(fd, "%lf", &( almanax_GPS[i-1].M0));//6 - M0 - средняя аномалия, полуциклы

almanax_GPS[i-1].PRN=i;



   }
     int imax=i;
     almanax_GPS[0].mass = imax;
  fclose(fd);

   //printf("num_week = %d " , almanax_GPS[1].num_week);

  return imax;
}
