/***************************************************************************//**
 * \file filename.с
 * \brief Краткое описание, назначение
 * \remarks Необязательная секция, для комментариев
 * \author Автор
 *
 * \if use_svn_keywords
 *  ::                                    $: Revision of last commit
 *  ::                                        $: Date of last commit
 *  ::                                      $: Author of last commit
 * \endif
 *
 ******************************************************************************/

/*******************************************************************************
 * Includes
 ******************************************************************************/
// Подключение необходимого минимума заголовочных файлов
// Первым должен подключаться интерфейсный файл модуля
#include <stdio.h>
#include "parserEphGPS.h"

/*******************************************************************************
 * Macro Definitions
 ******************************************************************************/
// Локальные макроопределения

/*******************************************************************************
 * Extern Data
 ******************************************************************************/
// Объявления экземпляров экспортируемых данных
data_t_GPS SISerr_GPS[75];
/*******************************************************************************
 * Local Data
 ******************************************************************************/
// Локальные объявления типов и данных

/*******************************************************************************
 * Local Function Prototypes
 ******************************************************************************/
// Прототипы локальных функций (без комментариев)

/*******************************************************************************
 * Function Pointers
 ******************************************************************************/
// Объявление указателей на функции (без комментариев)

/*******************************************************************************
 * Function Definitions
 ******************************************************************************/
// Реализация функций
// Сначала реализация интерфейсных функций, далее реализация локальных функций
// Все функции должны иметь описание

int parseEph_GPS(const char* file)
{
  int i;
  FILE* fd;
  char systype;
  char dummy[30];
  fd = fopen(file, "r");
  while ( !feof(fd) )
  {
    fscanf(fd, "%c", &systype);
    fscanf(fd, "%c", &systype);
   /* if (systype !=('G'|| 'R'))
    {
      printf("Sync error\n");
      break;
    }*/
    fscanf(fd, "%d", &i); //01  123      - орбитальный слот или PRN (R01-R24 для ГЛОНАСС, G01-G32 для GPS), либо

   SISerr_GPS[i-1].systype = systype;
    fscanf(fd, "%d", (int *)dummy); //02  1        - учет признака пригодности (0-только пригодные КА по данным навигационных сообщений,
    //           1 - возможно использование непригодных по данным эфемерид,
    //           2 - возможно использование непригодных по данным альманахов,
    //           3 - возможно использование любых непригодных эфемерид)
    fscanf(fd, "%u", (unsigned int *)dummy); //03  12       - число
    fscanf(fd, "%c", dummy);
    fscanf(fd, "%u", (unsigned int *)dummy); //04  12       - месяц
    fscanf(fd, "%c", dummy);
    fscanf(fd, "%u", (unsigned int *)dummy);//05  12       - год
    fscanf(fd, "%u", (unsigned int *)dummy);//06  12       - часы     UTC
    fscanf(fd, "%c", dummy);
    fscanf(fd, "%u", (unsigned int *)dummy); //07  12       - минуты   UTC
    fscanf(fd, "%c", dummy);
    fscanf(fd, "%u", (unsigned int *)dummy);  //08  12       - секунды  UTC
    fscanf(fd, "%lf", (double *)dummy);  //09  123.123  - длительность интервала оценки, сутки
    fscanf(fd, "%u", (unsigned int *)dummy);  //10  123456   - общее число обработанных точек
    fscanf(fd, "%u", (unsigned int *)dummy);  //11  123      - % вошедших в оценку точек R, N, B
    fscanf(fd, "%u", (unsigned int *)dummy);  //12  123      - % вошедших в оценку точек часы
    fscanf(fd, "%u", (unsigned int *)dummy);  //13  123      - % вошедших в оценку точек SISRE
    fscanf(fd, "%u", (unsigned int *)dummy);  //14  123      - % вошедших в оценку точек Vr, Vn, Vb
    fscanf(fd, "%u", (unsigned int *)dummy);  //15  123      - % вошедших в оценку точек частота
    fscanf(fd, "%u", (unsigned int *)dummy);  //16  123      - % вошедших в оценку точек SISVE
    fscanf(fd, "%lf", (double *)dummy);// 17  123.123  - МО ошибки R, м           МIN ошибки R, м           Med модуля ошибки R, м
    fscanf(fd, "%lf", (double *)dummy);// 18  123.123  - МО ошибки N, м           МIN ошибки N, м           Med модуля ошибки N, м
    fscanf(fd, "%lf", (double *)dummy);//19  123.123  - МО ошибки B, м           МIN ошибки B, м           Med модуля ошибки B, м
    fscanf(fd, "%lf", (double *)dummy);//20  123.123  - МО ошибки часов, нс      МIN ошибки часов, нс      Med модуля ошибки часов, нс
    fscanf(fd, "%lf", (double *)dummy);//21  123.123  - МО ошибки SISRE, м       МIN ошибки SISRE, м       Med модуля ошибки SISRE, м
    fscanf(fd, "%lf", (double *)dummy);//22  123.123  - СКП R, м                 МAX ошибки R, м           95% модуля ошибки R, м
    fscanf(fd, "%lf", (double *)dummy);//23  123.123  - СКП N, м                 МAX ошибки N, м           95% модуля ошибки N, м
    fscanf(fd, "%lf", (double *)dummy);//24  123.123  - СКП B, м                 МAX ошибки B, м           95% модуля ошибки B, м
    fscanf(fd, "%lf", (double *)dummy);//25  123.123  - СКП часов, нс            МAX ошибки часов, нс      95% модуля ошибки часов, нс
    fscanf(fd, "%lf", &(SISerr_GPS[i-1].SISRE));//26  123.123  - СКП SISRE, м             МAX ошибки SISRE, м       95% модуля ошибки SISRE, м
    fscanf(fd, "%lf", (double *)dummy);//27  123.123  - МО ошибки VR, мм/с       МIN ошибки VR, мм/с       Med ошибки VR, мм/с
    fscanf(fd, "%lf", (double *)dummy);//28  123.123  - МО ошибки VN, мм/с       МIN ошибки VN, мм/с       Med ошибки VN, мм/с
    fscanf(fd, "%lf", (double *)dummy);//29  123.123  - МО ошибки VB, мм/с       МIN ошибки VB, мм/с       Med ошибки VB, мм/с
    fscanf(fd, "%lf", (double *)dummy);//30  123.123  - МО ошибки частоты, нс/с  МIN ошибки частоты, нс    Med ошибки частоты, нс
    fscanf(fd, "%lf", (double *)dummy);//31  123.123  - МО ошибки SISVE, м       МIN ошибки SISVE, м       Med ошибки SISVE, мм/с
    fscanf(fd, "%lf", (double *)dummy);//32  123.123  - СКП VR, мм/с             МAX ошибки VR, мм/с       95% ошибки VR, мм/с
    fscanf(fd, "%lf", (double *)dummy);//33  123.123  - СКП VN, мм/с             МAX ошибки VN, мм/с       95% ошибки VN, мм/с
    fscanf(fd, "%lf", (double *)dummy);//34  123.123  - СКП VB, мм/с             МAX ошибки VB, мм/с       95% ошибки VB, мм/с
    fscanf(fd, "%lf", (double *)dummy);//35  123.123  - СКП частоты, нс/с        МAX ошибки часов, нс/c    95% ошибки часов, нс/c
    fscanf(fd, "%lf", &(SISerr_GPS[i-1].SISVE));//36  123.123  - СКП SISVE, мм/с          МAX ошибки SISVE, мм/с    95% ошибки SISVE, мм/с
   fscanf(fd, "%c", &systype);
  }
  int imax=i;
  fclose(fd);
 return imax;
}








/*******************************************************************************
 * END OF FILE
 ******************************************************************************/

