clc;clear all;close all;

N4=5
                            N=789;
                             ti=54000;
                               N_A=788;
                            tlymbda_A=788;
                              dT=0.452390625e+4;
                              dI=-0.2656127e+4;
                         dTT=0.1220703E-02;%0.6758690E-02
                          Ee=0.5750656E-03;
                             omegaA = 0.3695374E+00
                           eLam =0.5243139E+00





 Tsr = 43200; 
isr = 63; 
if (N4 == 27)
  dN_A= N-N_A-(floor((N-N_A)/1461)*1460); 
else
  dN_A= N-N_A-(floor((N-N_A)/1461)*1461);
end
 dtpr = dN_A*86400+(ti-tlymbda_A);


 W = floor(dtpr/(Tsr+dT)); 

%%3 ќпредел€етс€ текущее наклонение:
 i = ((isr/180)+dI)*pi; %%?iA = dI ? Ц поправка к среднему значению наклонени€ орбиты.

%%4 ќпредел€ютс€ средний драконический период на витке W+1 и среднее движение:
 Tdr = Tsr+dT+(2*W+1)*dTT; %%dT'a = dTT; половинна€ скорость изменени€ драконического периода.

 n = 2*pi/Tdr;

%%5.ћетодом последовательных приближений m = 0, 1, 2Е рассчитываетс€ больша€ полуось орбиты a:

 GM = 398600441.8e6; %%геоцентрическа€ константа гравитационного пол€ «емли с учетом атмосферы,
 ae = 6378136; % больша€ (экваториальна€) полуось общеземного эллипсоида ѕ«-90
 J02 = 1082.62575e-6;%зональный гармонический коэффициент второй степени
 epsA = Ee;
%стартовые значени€
 a_old = 0;
a = 1;
Tosk = Tdr;
p = 0;

ksh=0;
while (abs(a-a_old)>1e-5)
a_old = a;
a = ((((Tosk/(2*pi))^2)*GM)^(1/3)); %Tock = Tdr;
p = a*(1-(epsA^2));
Tosk = Tdr/((1-(3/2)*J02*((ae/p)^2))*((2-(5/2)*(sin(i)^2))*(((1-(epsA^2)^(3/2)))/(1+epsA*(cos(omegaA*pi)^2)))+(1+epsA*(cos(omegaA*pi)^3))/(1-(epsA^2))));

    ksh=ksh+1;
end

%  eq1 = 2 - (5/2)*sin(i)^2;
%  eq2 = 1 - (epsA^2);
%  eq3 = 1 + epsA*cos(omegaA*pi);
%  eq4 =(eq2^(3/2));
%  eq5 = (eq3^2);
%  eq6 = eq4 / eq5;
%  eq7 = (eq3^3);
%  eq8 = eq7 / eq2;
%  Big_div = eq1 * eq6 + eq8;

% printf("J02  = %0.9f c\n", J02 );
% printf("a = %0.9f c\n", a);
% printf("p = %0.9f c\n", p);
% printf("Tosk  = %0.9f c\n", Tosk );

%  ksh = 1;
% while (abs(a - a_old) > 1e-5)
% a_old = a;
% a = ((((Tosk/(2*pi))^2)*GM)^(1/3));
% p = a*eq2;
% eq9 = 1 - (3/2)*J02*(((ae/p)^2));
% Tosk = Tdr/(eq9*Big_div);
% ksh=ksh+1;
% end