
/***************************************************************************//**
 * \file filename.с
 * \brief Краткое описание, назначение
 * \remarks Необязательная секция, для комментариев
 * \author Автор
 *
 * \if use_svn_keywords
 *  ::                                    $: Revision of last commit
 *  ::                                        $: Date of last commit
 *  ::                                      $: Author of last commit
 * \endif
 *
 * \b LICENSE \b INFORMATION \n
 *  Copyright (c) Year, Company, City, Country
 ******************************************************************************/

/*******************************************************************************
 * Includes
 ******************************************************************************/
// Подключение необходимого минимума заголовочных файлов
// Первым должен подключаться интерфейсный файл модуля
#include <stdio.h>
#include "include/parserGLNS.H"

//#include "parserGPS.h"
/*******************************************************************************
 * Macro Definitions
 ******************************************************************************/
// Локальные макроопределения

/*******************************************************************************
 * Extern Data
 ******************************************************************************/
// Объявления экземпляров экспортируемых данных
data_almanax_GLNS almanax_GLNS[75];
/*******************************************************************************
 * Local Data
 ******************************************************************************/
// Локальные объявления типов и данных

/*******************************************************************************
 * Local Function Prototypes
 ******************************************************************************/
// Прототипы локальных функций (без комментариев)

/*******************************************************************************
 * Function Pointers
 ******************************************************************************/
// Объявление указателей на функции (без комментариев)

/*******************************************************************************
 * Function Definitions
 ******************************************************************************/
// Реализация функций
// Сначала реализация интерфейсных функций, далее реализация локальных функций
// Все функции должны иметь описание

/*******************************************************************************
 * END OF FILE
 *****************************************************/


int parseGLNS(const char* file)
{
  int i;
  int  Numbb;
  char dummy[50];
    FILE *fd;
   // string file = "MCCJ_150306.AGP";
    fd = fopen(file, "r");
   //fd = fopen("test.txt", "r");
    if (fd == NULL)
    {
         printf("ERORR");
    }
    else{ printf("OK"); }
    while ( !feof(fd) )                               // пока не конец файла
    {
    //   almanax_GLNS[i-1].systype = systype;

//Строка 1
fscanf(fd, "%u", (int *)dummy); //1 - число пhttps://vk.com/doc165113148_595394058?hash=f2e6d67d96e5f1a609&dl=ab5ddaf49d0048c0feолучения альманаха
fscanf(fd, "%u", (int *)dummy); //2 - месяц получения альманаха
fscanf(fd, "%u", (int *)dummy); //3 - год получения альманаха
fscanf(fd, "%u", &Numbb); //4 -


//Строка 2
fscanf(fd, "%u", &(i));//1 - номер PRN
almanax_GLNS[i-1].PRN=i;
almanax_GLNS[i-1].NN = Numbb;
fscanf(fd, "%u", (int *)dummy);//2 - номер частотного слота (-7 - 24)
fscanf(fd, "%u", (int *)dummy);//3 - признак здоровья по альманаху (0 - 1)
fscanf(fd, "%u", &(almanax_GLNS[i-1].date));//4 - число
fscanf(fd, "%u", &(almanax_GLNS[i-1].month));//5 - месяц
fscanf(fd, "%u", &(almanax_GLNS[i-1].year));//6 - год
fscanf(fd, "%lf", &(almanax_GLNS[i-1].tLA));//7 - время прохождения первого узла, на которое все дано, с
fscanf(fd, "%lf", (double *)dummy);//8 - поправка ГЛОНАСС-UTC, с
fscanf(fd, "%lf", (double *)dummy);//9- поправка GPS-ГЛОНАСС, с
fscanf(fd, "%lf", (double *)dummy);//10 - поправка времени КА ГЛОНАСС относительно системного времени, с




//Строка 3
fscanf(fd, "%lf", &( almanax_GLNS[i-1].Lam ));//1 - Lam - долгота узла, полуциклы
fscanf(fd, "%lf", &( almanax_GLNS[i-1].dI));//2 - dI -коррекция наклонения, полуциклы
fscanf(fd, "%lf", &( almanax_GLNS[i-1].w));//3 -  w - аргумент перигея, полуциклы
fscanf(fd, "%lf", &( almanax_GLNS[i-1].E));//4 - E - эксцентриситет
fscanf(fd, "%lf", &( almanax_GLNS[i-1].dT));//5 - dT - поправка к драконическому периоду, с
fscanf(fd, "%lf", &( almanax_GLNS[i-1].dTT));//6 - dTT - поправка к драконическому периоду, с/виток

almanax_GLNS[i-1].PRN=i;



   }
     int imax=i;
     almanax_GLNS[0].mass = imax;
  fclose(fd);

   //printf("num_week = %d " , almanax_GPS[1].num_week);

  return imax;
}
